import { calcAdv, diagramAdv, rayAdv, skiftech } from 'src/assets';

export const mainPageContent = {
    hero: {
        title: 'Optiflow - зручні оптичні розрахунки',
        text: "Зручний та швидкий сервіс для проведення розрахунків пов'язаних з областю передачі даних в оптичних системах.",
    },

    advantages: {
        title: 'Можливості сервісу',
        cards: [
            {
                title: 'Зручний калькулятор',
                text: 'Зручний інтерфейс стане для вас справжнім помічником. Він допоможе вам швидко розрахувати потрібні параметри та зберегти розрахунки у файл.',
                link: '/calculator',
                picture: calcAdv,
            },
            {
                title: 'Візуалізація променю',
                text: 'Сервіс дає вам унікальну можливість перевірити не тільки точність ваших розрахунків але й наглядно візуалізувати їх у трьохмірний промінь.',
                link: '/ray',
                picture: rayAdv,
            },
            {
                title: '3D - Діаграма спрямованості',
                text: 'Окремий сервіс візуалізації діаграми спрямованості допоможе вам відтворити вашу двовимірну діаграму у тривимірну модель.',
                link: '/diagram',
                picture: diagramAdv,
            },
        ],
    },

    companies: {
        title: 'Для кого буде актуальний сервіс',
        text: 'Наразі цей сервіс був розроблений спеціально для співробітників компанії Skiftech але його зможе використовувати будь-який авторизований користувач за потреби.',
        logos: [skiftech],
    },
};
