import { skiftech } from 'src/assets';

export const mainPageContent = {
    hero: {
        title: 'Розрахунок області передачі даних',
        text: 'На глибині глибокого океану, де світло не сяє, таємничі створіння рухаються у водяному вирі. Їхні світлові вуса розсіюються в темряві, надаючи інтригуючого вигляду цьому незнайомому світові.',
    },

    advantages: {
        title: 'Чому ми?',
        cards: [
            {
                title: 'Зручний калькулятор',
                text: 'На рибальських турнірах зазвичай час рухається сповільнено, так ніби він допомагає рибалців потонути в атмосфері спокою і тиші. Вони сидять біля водойм, віддаючись власній внутрішній гармонії.',
                picture:
                    'https://c4.wallpaperflare.com/wallpaper/419/678/549/audi-e-tron-gt-electric-cars-4k-wallpaper-preview.jpg',
            },
            {
                title: 'Візуалізація променів',
                text: 'На рибальських турнірах зазвичай час рухається сповільнено, так ніби він допомагає рибалців потонути в атмосфері спокою і тиші. Вони сидять біля водойм, віддаючись власній внутрішній гармонії.',
                picture:
                    'https://c4.wallpaperflare.com/wallpaper/419/678/549/audi-e-tron-gt-electric-cars-4k-wallpaper-preview.jpg',
            },
            {
                title: 'Візуалізація діаграми спрямованості',
                text: 'На рибальських турнірах зазвичай час рухається сповільнено, так ніби він допомагає рибалців потонути в атмосфері спокою і тиші. Вони сидять біля водойм, віддаючись власній внутрішній гармонії.',
                picture:
                    'https://c4.wallpaperflare.com/wallpaper/419/678/549/audi-e-tron-gt-electric-cars-4k-wallpaper-preview.jpg',
            },
        ],
    },

    companies: {
        title: 'Для кого буде актуальний сервіс',
        text: 'На рибальських турнірах зазвичай час рухається сповільнено, так ніби він допомагає рибалців потонути в атмосфері спокою і тиші. Вони сидять біля водойм, віддаючись власній внутрішній гармонії та зосередженості, тільки чутливі вудки і легкий шум води порушують цю ідилію. Рибалка — це не тільки мистецтво вловити рибу, це також про вміння розслабитися і насолоджуватися моментом. Навіть якщо удача не посміхнеться, рибалка все одно виграє спокоєм і злагодою, які надає ця заняття.',
        logos: [skiftech],
    },
};
